local function run (msg , matches)
if matches[1]:lower() == "الاوامر" or matches[1] == 'help' and is_mod(msg) then
if not lang then
text = [[
🔹- اهلا صديقي هناك 4 قوائم ليتم عرضها 👨‍🔧 

🔸➖➖➖➖➖➖➖➖➖🔸

🔷- م1 لعرض قائمه الحمايه 🛠

🔷- م2 لعرض قائمه الميديا 👁‍🗨

🔷- م3 لعرض قائمه المجموعه 💭

🔷- م4 لعرض قائمه اوامر المطور 🕹

🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
 ;)]]

elseif lang then

text = [[
🔹- اهلا صديقي هناك 4 قوائم ليتم عرضها 👨‍🔧 

🔸➖➖➖➖➖➖➖➖➖🔸

🔷- h1 لعرض قائمه الحمايه 🛠

🔷- h2 لعرض قائمه الميديا 👁‍🗨

🔷- h3 لعرض قائمه المجموعه 💭

🔷- h4 لعرض قائمه اوامر المطور 🕹

🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
  ;)]]
end
return text
end
-----------------------------------------
if matches[1]:lower() == "h1" or matches[1] == 'م1' and is_mod(msg) then
if not lang then
lock = "Group name:"..msg.to.title..[[
🔹- اهلا صديقي في اوامر الحمايه 👁‍🗨

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- قفل : لقفل امر محدد 🔒
🎈- فتح : لفتح امر محدد 🔓

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- الروابط  ¦ 📧
🎈- التوجيه ¦♻️
🎈- التاك ¦ 🏷
🎈- التعديل ¦ 📎
🎈- البوتات ¦ 👾
🎈-التكرار ¦ ⚠️
🎈- الكلايش ¦ 📝
🎈- العربيه ¦ 📖
🎈- الفشار ¦ 🔞
🎈- الاضافه ¦ 🖇
🎈- الويب ¦ 💻

🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name

elseif lang then

lock = "Group name:"..msg.to.title..[[
🔹- اهلا صديقي في اوامر الحمايه 👁‍🗨

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- قفل : لقفل امر محدد 🔒
🎈- فتح : لفتح امر محدد 🔓

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- الروابط  ¦ 📧
🎈- التوجيه ¦♻️
🎈- التاك ¦ 🏷
🎈- التعديل ¦ 📎
🎈- البوتات ¦ 👾
🎈-التكرار ¦ ⚠️
🎈- الكلايش ¦ 📝
🎈- العربيه ¦ 📖
🎈- الفشار ¦ 🔞
🎈- الاضافه ¦ 🖇
🎈- الويب ¦ 💻

🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name
end
return lock
end
-----------------------------------------
if matches[1]:lower() == "h2" or matches[1] == 'م2' and is_mod(msg) then
if not lang then
lock2 = "Group name:"..msg.to.title..[[
🔹- اهلا صديقي في اوامر الميديا 👁‍🗨

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- قفل : لقفل امر محدد 🔒
🎈- فتح : لفتح امر محدد 🔓

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- المتحركه  ¦ 🎞
🎈- الصور ¦📸
🎈- الصوت ¦ 🎙
🎈- الملفات ¦ 📁
🎈- الفيديو ¦ 🎥
🎈-الملصقات ¦ 💈
🎈- الدردشه ¦ 📤
🎈- الجهات ¦ 💎
🎈- الكل ¦ ⚙
🎈- الانلاين ¦ ⌨

🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = "Group name:"..msg.to.title..[[
🔹- اهلا صديقي في اوامر الميديا 👁‍🗨

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- قفل : لقفل امر محدد 🔒
🎈- فتح : لفتح امر محدد 🔓

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- المتحركه  ¦ 🎞
🎈- الصور ¦📸
🎈- الصوت ¦ 🎙
🎈- الملفات ¦ 📁
🎈- الفيديو ¦ 🎥
🎈-الملصقات ¦ 💈
🎈- الدردشه ¦ 📤
🎈- الجهات ¦ 💎
🎈- الكل ¦ ⚙
🎈- الانلاين ¦ ⌨

🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name
end
return lock2
end
-----------------------------------------
if matches[1]:lower() == "h3" or matches[1] == "م3" and is_mod(msg) then
if not lang then
helpfun = "Group name:"..msg.to.title..[[
🔹- اهلا صديقي في اوامر المجموعه 🎈

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- رفع مدير ¦ لرفع مدير في المجموعه 🗣
🎈- تنزيل مدير ¦ لتنزيل مدير من المجموعه 🗣
🔸---------------------------------🔸
🎈- رفع ادمن ¦ لرفع ادمن في المجموعه🗣
🎈- تنزيل ادمن ¦ لتنزيل ادمن من المجموعه🗣
🔸---------------------------------🔸
🎈- وضع تكرار [1/50] 〽️
🔸---------------------------------🔸
🎈- طرد ¦ لطرد عضو من المجموعه 🔅
---------------------------------
🎈- حظر ¦ لحظر عضو من المجموعه 🔅
🔸---------------------------------🔸
🎈- معلومات ¦ لعرض معلومات العضو ❕
🎈- ايدي ¦ لعرض ايديك او ايدي شخص اخر ❗️
---------------------------------
🎈- الحساب + الايدي ¦ لاضهار الحساب 
🔸---------------------------------🔸
🎈- وضع { قوانين | صوره | رابط | وصف }
🔸---------------------------------🔸
🎈-مسح { قائمه المحضورين| المشرفين| البوتات | القوانين | الوصف | قائمة المكتومين |  قائمه الكلمات | الترحيب }
🔸---------------------------------🔸
🎈- تثبيت ¦ لتثبيت رساله ❗️
🎈- الغاء تثبيت ¦ لـ الغاء تثبيت
🔸---------------------------------🔸
🎈- تفعيل / تعطيل الترحيب ¦ لتفعيل وتعطيل الترحيب ❗️
🎈- وضع ترحيب ¦ لوضع ترحيب 💬
🔸---------------------------------🔸
🎈- الاعدادات ¦ لعرض الاعدادات 
🔸---------------------------------🔸
🎈- قائمه المحظورين ¦ لـ اضهار قائمه المحضورين
🎈- قائمه المكتومين ¦ لاضهار المكتومين😶
🎈- الادمنيه ¦ لـ اضهار الادمنيه👤
🎈- موقعي ¦ لاضهار موقعك 👨‍🏫

🔸➖➖➖➖➖➖➖➖➖🔸


DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, helpfun, 1, 'md')
else

helpfun = "Group name:"..msg.to.title..[[
🔹- اهلا صديقي في اوامر المجموعه 🎈

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- رفع مدير ¦ لرفع مدير في المجموعه 🗣
🎈- تنزيل مدير ¦ لتنزيل مدير من المجموعه 🗣
🔸---------------------------------🔸
🎈- رفع ادمن ¦ لرفع ادمن في المجموعه🗣
🎈- تنزيل ادمن ¦ لتنزيل ادمن من المجموعه🗣
🔸---------------------------------🔸
🎈- وضع تكرار [1/50] 〽️
🔸---------------------------------🔸
🎈- طرد ¦ لطرد عضو من المجموعه 🔅
---------------------------------
🎈- حظر ¦ لحظر عضو من المجموعه 🔅
🔸---------------------------------🔸
🎈- معلومات ¦ لعرض معلومات العضو ❕
🎈- ايدي ¦ لعرض ايديك او ايدي شخص اخر ❗️
---------------------------------
🎈- الحساب + الايدي ¦ لاضهار الحساب 
🔸---------------------------------🔸
🎈- وضع { قوانين | صوره | رابط | وصف }
🔸---------------------------------🔸
🎈-مسح { قائمه المحضورين| المشرفين| البوتات | القوانين | الوصف | قائمة المكتومين |  قائمه الكلمات | الترحيب }
🔸---------------------------------🔸
🎈- تثبيت ¦ لتثبيت رساله ❗️
🎈- الغاء تثبيت ¦ لـ الغاء تثبيت
🔸---------------------------------🔸
🎈- تفعيل / تعطيل الترحيب ¦ لتفعيل وتعطيل الترحيب ❗️
🎈- وضع ترحيب ¦ لوضع ترحيب 💬
🔸---------------------------------🔸
🎈- الاعدادات ¦ لعرض الاعدادات 
🔸---------------------------------🔸
🎈- قائمه المحظورين ¦ لـ اضهار قائمه المحضورين
🎈- قائمه المكتومين ¦ لاضهار المكتومين😶
🎈- الادمنيه ¦ لـ اضهار الادمنيه👤
🎈- موقعي ¦ لاضهار موقعك 👨‍🏫

🔸➖➖➖➖➖➖➖➖➖🔸


DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, helpfun, 1, 'md')
end
end
-----------------------------------------
if matches[1] == "h4" or  matches[1] == "م4" and is_mod(msg) then
if not lang then
text = [[
🔹- اهلا صديقي في اوامر المطور👁‍🗨

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- تفعيل + الايدي ¦ لـ تفعيل البوت في المجموعه✅
🎈- تعطيل  ¦ لـ تعطيل البوت في المجموعه❎
🎈- رفع مطور ¦ لرفع مطور في البوت 🤖
🎈- تنزيل مطور ¦ لتنزيل مطور من البوت 🤖
🎈- المطورين  ¦  لضهار قائمه المطورين في البوت 🤖
🔸---------------------------------🔸
🎈- ترقيه ادمن ¦ لرفع ادمن اساسي في البوت 🤖
🎈- حذف ادمن ¦ لحذف ادمن اساسي من البوت 🤖
🎈- قائمه الاساسي ¦ لاضهار الادمنيه الاساسين في البوت 🤖
🔸---------------------------------🔸
🎈- غادر ¦ لـ اخراج البوت من المجموعه ♨️
🎈-الخروج التلقائي¦  لخروج البوت تلقائيا من المجموعه ⚠️
🔸---------------------------------🔸

🎈- صنع مجموعه ¦ لصنع مجموعه عاديه 🚸
🎈- صنع مجموعه سوبر ¦ لصنه مجموعه سوبر 🌐
🎈- ترقيه سوبر ¦ لجعل المجموعه سوبر 🌀
🎈- اذاعه ¦ لعمل اذاعه في البوت 📢
🎈- وضع مده + العدد ¦ لتفعيل البوت لمده محدده ™
🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'md')
else

text = [[
🔹- اهلا صديقي في اوامر المطور👁‍🗨

🔸➖➖➖➖➖➖➖➖➖🔸

🎈- تفعيل + الايدي ¦ لـ تفعيل البوت في المجموعه✅
🎈- تعطيل  ¦ لـ تعطيل البوت في المجموعه❎
🎈- رفع مطور ¦ لرفع مطور في البوت 🤖
🎈- تنزيل مطور ¦ لتنزيل مطور من البوت 🤖
🎈- المطورين  ¦  لضهار قائمه المطورين في البوت 🤖
🔸---------------------------------🔸
🎈- ترقيه ادمن ¦ لرفع ادمن اساسي في البوت 🤖
🎈- حذف ادمن ¦ لحذف ادمن اساسي من البوت 🤖
🎈- قائمه الاساسي ¦ لاضهار الادمنيه الاساسين في البوت 🤖
🔸---------------------------------🔸
🎈- غادر ¦ لـ اخراج البوت من المجموعه ♨️
🎈-الخروج التلقائي¦  لخروج البوت تلقائيا من المجموعه ⚠️
🔸---------------------------------🔸

🎈- صنع مجموعه ¦ لصنع مجموعه عاديه 🚸
🎈- صنع مجموعه سوبر ¦ لصنه مجموعه سوبر 🌐
🎈- ترقيه سوبر ¦ لجعل المجموعه سوبر 🌀
🎈- اذاعه ¦ لعمل اذاعه في البوت 📢
🎈- وضع مده + العدد ¦ لتفعيل البوت لمده محدده ™
🔸➖➖➖➖➖➖➖➖➖🔸

DEV 〰 @D_1_T
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'md')
end
end
end


return {
patterns ={
"^([Hh]elp)$",
"^([Hh]1)$",
"^([Hh]2)$",
"^([Hh]3)$",
"^([Hh]4)$",
"^(الاوامر)$",
"^(م1)$",
"^(م2)$",
"^(م3)$",
"^(م4)$"

}, 
run =run
}
